Tekla.Structures.Dialog.UIControls.EnvironmentFiles
The EnvironmentFiles class is for the paths where the attributes file will be searched for.
using System.Collections.Generic;
using Tekla.Structures.Catalogs;
using Tekla.Structures.Dialog.UIControls;
using Tekla.Structures.Model;
namespace EnvFilesExample
{
internal class Program
{
static void Main()
{
List<string> folderList = EnvironmentFiles.GetStandardPropertyFileDirectories();
List<string> reportList = EnvironmentFiles.GetMultiDirectoryFileList(folderList, "rpt");
ComponentItem basePlateComponentItem = new ComponentItem();
basePlateComponentItem.Select("Base Plate Detail", 1014);
string basePlateAttribFileExtension = basePlateComponentItem.AttributeFileExtension;
List<string> basePlateList = EnvironmentFiles.GetMultiDirectoryFileList(folderList, basePlateAttribFileExtension);
ComponentItem meshBarsComponentItem = new ComponentItem();
meshBarsComponentItem.Select("MeshBars", BaseComponent.PLUGIN_OBJECT_NUMBER);
string meshBarsAttribFileExtension = meshBarsComponentItem.AttributeFileExtension;
List<string> meshBarsList = EnvironmentFiles.GetMultiDirectoryFileList(folderList, meshBarsAttribFileExtension);
}
}
}